{
    "basics": {
        "name": "Jonathan I. MG",
        "label": "Frontend Developer | Automation QA Engineer",
        "image": "/profile.jpg",
        "email": "join_mg@hotmail.com",
        "summary": "Frontend & Automation QA con m谩s de 7 a帽os de experiencia en IT. Ex Frontend Developer, actualmente enfocado en calidad, automatizaci贸n y confiabilidad. Me dedico a probar sistemas, romper cosas a prop贸sito y ayudar a los equipos a entregar software estable. Dungeon Master en mis ratos libres, invocando UIs limpias y planes de prueba bien balanceados ",
        "location": {
            "city": "Guadalajara",
            "countryCode": "MX",
            "region": "Jalisco"
        },
        "profiles": [
            {
                "network": "LinkedIn",
                "username": "jimtzg",
                "url": "https://www.linkedin.com/in/jimtzg/"
            },
            {
                "network": "GitHub",
                "username": "JonaMG0812",
                "url": "https://github.com/JonaMG0812"
            }
        ]
    },
    "work": [
        {
            "name": "Infosys Technologies",
            "position": "QA Analyst",
            "url": "https://www.infosys.com/",
            "startDate": "2023-04-01",
            "endDate": "2025-11-01",
            "summary": "QA Analyst enfocado en pruebas manuales para aplicaciones web e IVR, con 茅nfasis en validaci贸n funcional, cobertura de regresi贸n y confiabilidad del producto. Participaci贸n activa en dise帽o de pruebas, gesti贸n de defectos y documentaci贸n dentro de equipos Agile.",
            "highlights": [
                "Dise帽o y ejecuci贸n de m谩s de 250 casos de prueba para sistemas web e IVR usando Zephyr, incrementando la cobertura de pruebas en un 30% en aplicaciones clave del cliente.",
                "Lider茅 ciclos de pruebas manuales (funcionales, regresi贸n y sanity), identificando y documentando m谩s de 180 defectos en JIRA, reduciendo la fuga de defectos a producci贸n en un 25%.",
                "Colaboraci贸n con equipos Agile multidisciplinarios para validar nuevas funcionalidades, acelerando la preparaci贸n de releases en un 15% mediante ciclos de prueba optimizados.",
                "Creaci贸n de documentaci贸n detallada de pruebas en Confluence, asegurando trazabilidad completa entre requerimientos y validaciones.",
                "Evaluaciones de usabilidad y confiabilidad que derivaron en una reducci贸n del 20% en issues reportados por usuarios durante los primeros tres meses posteriores al despliegue."
            ],
            "keywords": [
                "ALM",
                "Azure DevOps",
                "Confluence",
                "Git",
                "JIRA",
                "Selenium",
                "TestRail",
                "Zephyr"
            ]
        },
        {
            "name": "Softtek",
            "position": "Software Development Engineer in Test / QA Lead",
            "url": "https://www.softtek.com",
            "startDate": "2021-07-01",
            "endDate": "2023-04-30",
            "summary": "Rol como SDET y QA Lead enfocado en estrategia de automatizaci贸n, cobertura de pruebas frontend y ownership de calidad a lo largo de ciclos Agile. Combin茅 automatizaci贸n hands-on con planeaci贸n de pruebas y colaboraci贸n entre equipos.",
            "highlights": [
                "Desarrollo y mantenimiento de suites de regresi贸n automatizadas con Selenium (Java) y Cucumber, incrementando la velocidad de ejecuci贸n de pruebas en un 40%.",
                "Introducci贸n de Cypress para pruebas frontend, reduciendo el tiempo de pruebas manuales de UI en un 35%.",
                "Mejora de cobertura en m贸dulos cr铆ticos del 65% al 90%, impactando directamente en la estabilidad de los releases y reduciendo incidentes post-deploy.",
                "Soporte a sprints Agile mediante la creaci贸n de mockups y planes de prueba alineados a user stories y criterios de aceptaci贸n.",
                "Uso de HP ALM, ARD, JIRA y Confluence para seguimiento de avances, defectos y consistencia documental entre equipos."
            ],
            "keywords": [
                "Azure DevOps",
                "Confluence",
                "Cypress",
                "Git",
                "Jenkins",
                "JIRA",
                "Selenium",
                "TestRail"
            ]
        },
        {
            "name": "Advanced Methods CO",
            "position": "Frontend Developer",
            "url": "https://www.amco.me/",
            "startDate": "2018-06-01",
            "endDate": "2020-02-28",
            "summary": "Frontend Developer enfocado en el mantenimiento y mejora de la interfaz de una plataforma de pagos, implementando actualizaciones de dise帽o, mejoras de rendimiento y modernizaci贸n de componentes visibles al usuario.",
            "highlights": [
                "Mantenimiento y optimizaci贸n de la UI del sistema de pagos de la empresa, implementando redise帽os completos de m贸dulos que mejoraron los tiempos de carga en un 25%.",
                "Traducci贸n de mockups de dise帽o a interfaces funcionales y responsivas, mejorando la experiencia de usuario y accesibilidad.",
                "Desarrollo y modernizaci贸n de templates de correos transaccionales, incrementando la consistencia de renderizado entre clientes en un 40%."
            ],
            "keywords": [
                "CSS3",
                "Git",
                "HAML",
                "JavaScript",
                "jQuery",
                "Jira",
                "Ruby on Rails",
                "Travis CI"
            ]
        },
        {
            "name": "Grupo CAPEM",
            "position": "Frontend Developer",
            "url": "https://grupocapem.com/",
            "startDate": "2018-05-01",
            "endDate": "2019-08-29",
            "summary": "Rol de desarrollo frontend enfocado en la construcci贸n de nuevos m贸dulos de UI y en mejorar la responsividad y usabilidad de una plataforma interna de pagos.",
            "highlights": [
                "Dise帽o e implementaci贸n de nuevos m贸dulos de UI y mejora de la responsividad de la plataforma interna de pagos del 0% al 100%, incrementando m茅tricas de usabilidad m贸vil.",
                "Colaboraci贸n con equipos de QA y backend para asegurar integraciones pixel-perfect, reduciendo defectos relacionados al frontend en un 20%."
            ],
            "keywords": [
                "Bootstrap",
                "Confluence",
                "CSS3",
                "Git",
                "JavaScript",
                "jQuery",
                "Jira",
                "Node.js",
                "Pug",
                "Sass"
            ]
        },
        {
            "name": "Tata Consultancy Services",
            "position": "Application Packager",
            "url": "https://www.tcs.com/",
            "startDate": "2017-06-01",
            "endDate": "2018-05-29",
            "summary": "Rol de Application Packager enfocado en la automatizaci贸n de instalaciones de software para entornos Windows Desktop y Server utilizando PowerShell y herramientas de despliegue empresarial.",
            "highlights": [
                "Despliegue de paquetes de software en cientos de estaciones de trabajo y servidores mediante SCCM, reduciendo esfuerzo manual y errores de configuraci贸n en un 40%.",
                "Desarrollo y mantenimiento de instaladores personalizados (.exe y .msi) con PowerShell, asegurando entornos de usuario consistentes y estandarizados."
            ],
            "keywords": [
                "Bash",
                "PowerShell",
                "SCCM"
            ]
        }
    ],
    "education": [
        {
            "institution": "Universidad de Colima",
            "url": "https://www.ucol.mx/",
            "area": "Ingenier铆a en Sistemas Computacionales",
            "studyType": "Ingenier铆a",
            "startDate": "2013-06-01",
            "endDate": "2017-07-29",
            "score": "8.2/10"
        }
    ],
    "certificates": [
        {
            "name": "Zephyr Scale User Guide",
            "date": "2023-06-15",
            "issuer": "SmartBear",
            "url": "https://smartbear.com/academy/zephyr%20enterprise/zephyr-enterprise-user-guide/"
        },
        {
            "name": "Selenium Tester Foundation",
            "date": "2022-06-20",
            "issuer": "iSQI Group",
            "url": "https://isqi.org/ISTQB-Certified-Tester-Foundation-Level-4.0-CTFL/CT-FL-4.2382"
        }
    ],
    "languages": [
        {
            "language": "Espa帽ol",
            "fluency": "Nativo",
            "description": "Comunicaci贸n profesional diaria"
        },
        {
            "language": "Ingl茅s",
            "fluency": "Profesional",
            "description": "Entornos t茅cnicos y de negocio"
        }
    ],
    "ui": {
        "workExperience": "Experiencia Laboral",
        "educationAndLanguages": "Educaci贸n e Idiomas",
        "certifications": "Certificaciones",
        "present": "Presente",
        "month": "mes",
        "months": "meses",
        "year": "a帽o",
        "years": "a帽os",
        "in": "en",
        "downloadCV": "Descargar CV",
        "letsTalk": "Cont谩ctame",
        "availableToWork": "Disponible para Trabajar"
    }
}